src/main/resources/authenticate_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP:Header/>
    <SOAP:Body>
        <Authenticate xmlns="http://schemas.cordys.com/1.0/webgateway">
            <username>@USERNAME@</username>
            <password>@PASSWORD@</password>
        </Authenticate>
    </SOAP:Body>
</SOAP:Envelope>